Tekla Open API Reference for Tekla Structures 2025
BentPlateGeometrySolver.AddLeg Method (ConnectiveGeometry, Contour, BentPlate.BendShape)
 Appends a polygon section to ConnectiveGeometry, using the maximal radius for the cylindrical connection, or the maximum cone aperture for conical connection.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectiveGeometry AddLeg(
	ConnectiveGeometry geometry,
	Contour polygon,
	BentPlate.BendShape bendShape
)
Public Function AddLeg (
	geometry As ConnectiveGeometry,
	polygon As Contour,
	bendShape As BentPlate.BendShape
) As ConnectiveGeometry
Parameters
geometry
Type: Tekla.Structures.Model.ConnectiveGeometry
ConnectiveGeometry used to create a connection with.
polygon
Type: Tekla.Structures.Model.Contour
The polygonal contour to add to geometry.
bendShape
Type: Tekla.Structures.Model.BentPlate.BendShape
Shape of the bend that connects the leg
Return Value
Type: ConnectiveGeometry
Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Exceptions
Exception | Condition
ConnectiveGeometryException | Thrown if could not create or modify ConnectiveGeometry instance.
ArgumentException | Thrown when geometry is a stand-alone bend geometry, meaning that the first GeometrySection is a BendSurfaceNode.
See Also
Reference
BentPlateGeometrySolver Class
AddLeg Overload
Tekla.Structures.Model Namespace